
<%@ page language="java" contentType="text/html; charset=UTF-8"
pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%@ taglib prefix="fn" uri="http://java.sun.com/jsp/jstl/functions"%>
<%@ taglib prefix="fmt" uri="http://java.sun.com/jsp/jstl/fmt"%>


<%

    Object lobj_getdata = session.getAttribute("m_sso_id");
    String sso_id = (String)lobj_getdata;

%>

<form>
<input type="hidden" id="sso_id" name="id" value="<%=sso_id%>">
</form>
<style>
	.base_table{
		width: 100%;
    	border-top: 2px #4fb3d2 solid;
    	border-bottom: 2px #4fb3d2 solid;
    	padding:5px;
    }
    .base_table td{
    	padding-left:10px;
    }
    .mypage_table th {text-align:left;padding-left: 10px;}
	.mypage_table td{padding-left:10px;}
	.radioGroup{text-align:right;}
	.radioGroup input{margin: 0px 5px;}
	.monitor2 h5, .monitor{color: red;}
</style>

<script>
sso_sysnc();


function onApply(){
	
	var id = $("#sso_id").val();
	
	if(id == "null")
	{
		alert("로그인이 필요합니다.");
		return false;
	}
	
	
		if ( $("#sido").val() == "")
	{
		alert("서울/경기/인천에 거주하는 회원만 가입하실 수 있습니다.");
		return false;
	}
	
		
	if (!$("input:radio[id='sex']:checked").val())
	{
		alert("성별을 선택해 주세요.");
		return false;
	}
	
	
	if ( $("#w_job").val() =="")
	{
		alert("직업을 선택해 주세요.");
		return false;
	}
	
	
	if ($("#gugun").val()== "선택")
	{
		alert("주소를 선택해주세요.");
		return false;
	}

	if ($("#dong").val()== "선택")
	{
		alert("주소를 선택해주세요.");
		return false;
	}
	
                $.ajax({
                        async : true,
                        type : "POST",
                        url : "joinmember.do",
                        data : $("#w_form").serialize(),
                        success : function(data) {
                                if (data.result == "success") {
					alert("신청이 완료되었습니다.");
					location.href = "https://research.seoul.go.kr/monitor/sso/logout.jsp";
                                } else {

                                }
                        },
                        error : function() {
                                alert("error!!");
                        }
                });


}


function onSSO()
{
	var id = $("#sso_id").val();

	if(id != "null")
	{
		location.href = "https://research.seoul.go.kr/monitor/sso/logout.jsp";
	}else{
		location.href = "https://www.seoul.go.kr/seoul/jsp/member/UserLogin.jsp?SITE_GB=GB002&refresh_url=https://research.seoul.go.kr/monitor/sso/index.jsp";
	}	

}

function sso_sysnc()
{
	var id = $("#sso_id").val();

	if(id != "null")
	{

                $.ajax({
                        async : true,
                        type : "POST",
                        url : "getbackendmember.do",
                        data : $("form").serialize(),
                        success : function(data) {
                                if (data.result == "success") {
				// web
					//console.log(data.account);
					$("#w_id").val(data.account.id);
					$("#name").val(data.account.name);
					$("#phone").val(data.account.phone);
					$("#email").val(data.account.email);
					$("#birth").val(data.account.birthday.substring(0, 8));
					
					var adult_chk = data.account.birthday.substring(0,4);
					
					var adt = 19; // 성년 나이
					var adt_max = 100; // 100세
					var d = new Date();
					var y = d.getFullYear();

					if ( (y - adult_chk) < 19 )
					{
						alert("만 19세 미만은 신청하실 수 없습니다.");
            location.href='<c:url value='/front/info/join/join_list.do'/>'				
					}
					
					$("#sidoji").val(data.account.sido);
					
					

					if(data.account.phone_type == "01"){
						$("input:radio[id='phone_type']:radio[value='01']").prop("checked", true);}

					if(data.account.phone_type == "02"){
						$("input:radio[id='phone_type']:radio[value='02']").prop("checked", true);}

					if(data.account.phone_type == "03"){
						$("input:radio[id='phone_type']:radio[value='03']").prop("checked", true);}

				// mobile
					$("#m_id").html(data.account.id);

					$("#m_h_id").val(data.account.id);

					$("#m_name").html(data.account.name);
					$("#m_phone").html(data.account.phone);
					$("#m_email").html(data.account.email);
					$("#m_birth").html(data.account.birthday.substring(0, 8));
					$("#m_sido").html(data.account.sido);
					
					if(data.account.phone_type == "01"){
						$("input:radio[id='phone_type1']:radio[value='01']").prop("checked", true);}

					if(data.account.phone_type == "02"){
						$("input:radio[id='phone_type1']:radio[value='02']").prop("checked", true);}

					if(data.account.phone_type == "03"){
						$("input:radio[id='phone_type1']:radio[value='03']").prop("checked", true);}


					$("#id").val(data.account.id);
					
					if (data.account.sido == "서울")
					{
						sojaeji('서울','선택');									
					}
					if (data.account.sido == "경기")
					{
						sojaeji('경기','선택');									
					}
					if (data.account.sido == "인천")
					{
	
						sojaeji('인천','선택');									
					}


                                } else {

                                }
                        },
                        error : function() {
                                alert("error!!");
                        }
                });
	}
}




function sojaeji( sido , gugun, dong) {
	
	var 
	addr ={	
	'시도' : ['서울','부산','대구','인천','광주','대전','울산','강원','경기','경남','경북','전남','전북','제주','충남','충북'],
	'서울' : ['선택','강남구','강동구','강북구','강서구','관악구','광진구','구로구','금천구','노원구','도봉구','동대문구','동작구','마포구','서대문구','서초구','성동구','성북구','송파구','양천구','영등포구','용산구','은평구','종로구','중구','중랑구'],
	'인천' : ['선택','계양구','남구','남동구','동구','부평구','서구','연수구','중구','강화군','옹진군'],
	'경기' : ['선택','고양시 덕양구','고양시 일산동구','고양시 일산서구','과천시','광명시','광주시','구리시','군포시','김포시','남양주시','동두천시','부천시 소사구','부천시 오정구','부천시 원미구','성남시 분당구','성남시 수정구','성남시 중원구','수원시 권선구','수원시 영통구','수원시 장안구','수원시 팔달구','시흥시','안산시 단원구','안산시 상록구','안성시','안양시 동안구','안양시 만안구','양주시','오산시','용인시 기흥구','용인시 수지구','용인시 처인구','의왕시','의정부시','이천시','파주시','평택시','포천시','하남시','화성시','가평군','양평군','여주군','연천군'],
	 '서울->강남구' : ['선택','개포1동','개포2동','개포4동','개포동','논현1동','논현2동','논현동','대치1동','대치2동','대치4동','대치동','도곡1동','도곡2동','도곡동','삼성1동','삼성2동','삼성동','세곡동','수서동','신사동','압구정동','역삼1동','역삼2동','역삼동','율현동','일원1동','일원2동','일원본동','일원동','자곡동','청담동','무역센터우체국사서함','서울강남우체국사서함','서울영동우체국사서함'],
	'서울->강동구' : ['선택','강일동','고덕1동','고덕2동','고덕동','길동','둔촌1동','둔촌2동','둔촌동','명일1동','명일2동','명일동','상일동','성내1동','성내2동','성내3동','성내동','암사1동','암사2동','암사3동','암사동','천호1동','천호2동','천호3동','천호동','서울강동우체국사서함'],
	'서울->강북구' : ['선택','미아동','번1동','번2동','번3동','번동','삼각산동','삼양동','송중동','송천동','수유1동','수유2동','수유3동','수유동','우이동','인수동','서울강북우체국사서함'],
	'서울->강서구' : ['선택','가양1동','가양2동','가양3동','가양동','개화동','공항동','과해동','내발산동','등촌1동','등촌2동','등촌3동','등촌동','마곡동','방화1동','방화2동','방화3동','방화동','염창동','오곡동','오쇠동','외발산동','우장산동','화곡1동','화곡2동','화곡3동','화곡4동','화곡6동','화곡8동','화곡본동','화곡동','서울강서우체국사서함','서울화곡우체국사서함'],
	'서울->관악구' : ['선택','낙성대동','난곡동','난향동','남현동','대학동','미성동','보라매동','봉천동','삼성동','서림동','서원동','성현동','신림동','신사동','신원동','은천동','인헌동','조원동','중앙동','청룡동','청림동','행운동','서울관악우체국사서함'],
	'서울->광진구' : ['선택','광장동','구의1동','구의2동','구의3동','구의동','군자동','능동','자양1동','자양2동','자양3동','자양4동','자양동','중곡1동','중곡2동','중곡3동','중곡4동','중곡동','화양동','서울광진우체국사서함','동서울우편집중국사서함'],
	'서울->구로구' : ['선택','가리봉동','개봉1동','개봉2동','개봉3동','개봉동','고척1동','고척2동','고척동','구로1동','구로2동','구로3동','구로4동','구로5동','구로동','궁동','신도림동','오류1동','오류2동','오류동','온수동','천왕동','항동','구로디지털단지우체국사서함'],
	'서울->금천구' : ['선택','가산동','독산1동','독산2동','독산3동','독산4동','독산동','시흥1동','시흥2동','시흥3동','시흥4동','시흥5동','시흥동','서울금천우체국사서함'],
	'서울->노원구' : ['선택','공릉1.3동','공릉2동','공릉동','상계1동','상계2동','상계3.4동','상계5동','상계6.7동','상계8동','상계9동','상계10동','상계동','월계1동','월계2동','월계3동','월계동','중계1동','중계2.3동','중계4동','중계본동','중계동','하계1동','하계2동','하계동','서울노원우체국사서함'],
	'서울->도봉구' : ['선택','도봉1동','도봉2동','도봉동','방학1동','방학2동','방학3동','방학동','쌍문1동','쌍문2동','쌍문3동','쌍문4동','쌍문동','창1동','창2동','창3동','창4동','창5동','창동'],
	'서울->동대문구' : ['선택','답십리1동','답십리2동','답십리동','신설동','용두동','이문1동','이문2동','이문동','장안1동','장안2동','장안동','전농1동','전농2동','전농동','제기동','청량리동','회기동','휘경1동','휘경2동','휘경동','동대문우체국사서함','서울청량우체국사서함'],
	'서울->동작구' : ['선택','노량진1동','노량진2동','노량진동','대방동','동작동','본동','사당1동','사당2동','사당3동','사당4동','사당5동','사당동','상도1동','상도2동','상도3동','상도4동','상도동','신대방1동','신대방2동','신대방동','흑석동','서울동작우체국사서함'],
	'서울->마포구' : ['선택','공덕동','구수동','노고산동','당인동','대흥동','도화동','동교동','마포동','망원1동','망원2동','망원동','상수동','상암동','서교동','성산1동','성산2동','성산동','신공덕동','신수동','신정동','아현동','연남동','염리동','용강동','중동','창전동','토정동','하중동','합정동','현석동','서울마포우체국사서함'],
	'서울->서대문구' : ['선택','남가좌1동','남가좌2동','남가좌동','냉천동','대신동','대현동','미근동','봉원동','북가좌1동','북가좌2동','북가좌동','북아현동','신촌동','연희동','영천동','옥천동','창천동','천연동','충정로2가','충정로3가','합동','현저동','홍은1동','홍은2동','홍은동','홍제1동','홍제2동','홍제3동','홍제동','서대문우체국사서함','서울충정로우체국사서함'],
	'서울->서초구' : ['선택','내곡동','반포1동','반포2동','반포3동','반포4동','반포본동','반포동','방배1동','방배2동','방배3동','방배4동','방배본동','방배동','서초1동','서초2동','서초3동','서초4동','서초동','신원동','양재1동','양재2동','양재동','염곡동','우면동','원지동','잠원동','서울서초우체국사서함'],
	'서울->성동구' : ['선택','금호동1가','금호동2가','금호동3가','금호동4가','도선동','마장동','사근동','상왕십리동','성수1가1동','성수1가2동','성수2가1동','성수2가3동','성수동1가','성수동2가','송정동','옥수동','왕십리2동','용답동','응봉동','하왕십리동','행당1동','행당2동','행당동','홍익동','서울성동우체국사서함'],
	'서울->성북구' : ['선택','길음1동','길음2동','길음동','돈암1동','돈암2동','돈암동','동선동1가','동선동2가','동선동3가','동선동4가','동선동5가','동소문동1가','동소문동2가','동소문동3가','동소문동4가','동소문동5가','동소문동6가','동소문동7가','보문동1가','보문동2가','보문동3가','보문동4가','보문동5가','보문동6가','보문동7가','삼선동1가','삼선동2가','삼선동3가','삼선동4가','삼선동5가','상월곡동','석관동','성북동','성북동1가','안암동1가','안암동2가','안암동3가','안암동4가','안암동5가','월곡1동','월곡2동','장위1동','장위2동','장위3동','장위동','정릉1동','정릉2동','정릉3동','정릉4동','정릉동','종암동','하월곡동','서울성북우체국사서함'],
	'서울->송파구' : ['선택','가락1동','가락2동','가락본동','가락동','거여1동','거여2동','거여동','마천1동','마천2동','마천동','문정1동','문정2동','문정동','방이1동','방이2동','방이동','삼전동','석촌동','송파1동','송파2동','송파동','신천동','오금동','오륜동','잠실2동','잠실3동','잠실4동','잠실6동','잠실7동','잠실본동','잠실동','장지동','풍납1동','풍납2동','풍납동','서울송파우체국사서함'],
	'서울->양천구' : ['선택','목1동','목2동','목3동','목4동','목5동','목동','신월1동','신월2동','신월3동','신월4동','신월5동','신월6동','신월7동','신월동','신정1동','신정2동','신정3동','신정4동','신정6동','신정7동','신정동','서울양천우체국사서함'],
	'서울->영등포구' : ['선택','당산동1가','당산동2가','당산동3가','당산동4가','당산동5가','당산동6가','당산동','대림1동','대림2동','대림3동','대림동','도림동','문래동1가','문래동2가','문래동3가','문래동4가','문래동5가','문래동6가','문래동','신길1동','신길3동','신길4동','신길5동','신길6동','신길7동','신길동','양평동1가','양평동2가','양평동3가','양평동4가','양평동5가','양평동6가','양평동','양화동','여의도동','영등포동1가','영등포동2가','영등포동3가','영등포동4가','영등포동5가','영등포동6가','영등포동7가','영등포동8가','영등포본동','영등포동','여의도우체국사서함','영등포우체국사서함'],
	'서울->용산구' : ['선택','갈월동','남영동','도원동','동빙고동','동자동','문배동','보광동','산천동','서계동','서빙고동','신계동','신창동','용문동','용산동1가','용산동2가','용산동3가','용산동4가','용산동5가','용산동6가','원효로1가','원효로2가','원효로3가','원효로4가','이촌1동','이촌2동','이촌동','이태원1동','이태원2동','이태원동','주성동','청암동','청파동1가','청파동2가','청파동3가','한강로1가','한강로2가','한강로3가','한남동','효창동','후암동','서울용산우체국사서함','서울우편집중국사서함'],
	'서울->은평구' : ['선택','갈현1동','갈현2동','갈현동','구산동','녹번동','대조동','불광1동','불광2동','불광동','수색동','신사1동','신사2동','신사동','역촌동','응암1동','응암2동','응암3동','응암동','증산동','진관동','서울은평우체국사서함'],
	'서울->종로구' : ['선택','가회동','견지동','경운동','계동','공평동','관수동','관철동','관훈동','교남동','교북동','구기동','궁정동','권농동','낙원동','내수동','내자동','누상동','누하동','당주동','도렴동','돈의동','동숭동','명륜동1가','명륜동2가','명륜동3가','명륜동4가','묘동','무악동','봉익동','부암동','사간동','사직동','삼청동','서린동','세종로','소격동','송월동','송현동','수송동','숭인1동','숭인2동','숭인동','신교동','신문로1가','신문로2가','신영동','안국동','연건동','연지동','예지동','옥인동','와룡동','운니동','원남동','원서동','이화동','익선동','인사동','인의동','장사동','재동','적선동','종로1가','종로2가','종로3가','종로4가','종로5가','종로6가','중학동','창성동','창신1동','창신2동','창신3동','창신동','청운동','청진동','체부동','충신동','통의동','통인동','팔판동','평동','평창동','필운동','행촌동','혜화동','홍지동','홍파동','화동','효자동','효제동','훈정동','광화문우체국사서함'],
	'서울->중구' : ['선택','광희동1가','광희동2가','남대문로1가','남대문로2가','남대문로3가','남대문로4가','남대문로5가','남산동1가','남산동2가','남산동3가','남창동','남학동','다동','만리동1가','만리동2가','명동1가','명동2가','무교동','무학동','묵정동','방산동','봉래동1가','봉래동2가','북창동','산림동','삼각동','서소문동','소공동','수표동','수하동','순화동','신당1동','신당2동','신당3동','신당4동','신당5동','신당6동','신당동','쌍림동','예관동','예장동','오장동','을지로1가','을지로2가','을지로3가','을지로4가','을지로5가','을지로6가','을지로7가','의주로1가','의주로2가','인현동1가','인현동2가','입정동','장교동','장충동1가','장충동2가','저동1가','저동2가','정동','주교동','주자동','중림동','초동','충무로1가','충무로2가','충무로3가','충무로4가','충무로5가','충정로1가','태평로1가','태평로2가','필동1가','필동2가','필동3가','황학동','회현동1가','회현동2가','회현동3가','흥인동','서울중앙우체국사서함'],
	'서울->중랑구' : ['선택','망우3동','망우본동','망우동','면목2동','면목3.8동','면목4동','면목5동','면목7동','면목본동','면목동','묵1동','묵2동','묵동','상봉1동','상봉2동','상봉동','신내1동','신내2동','신내동','중화1동','중화2동','중화동','서울중랑우체국사서함'],
	'인천->계양구' : ['선택','갈현동','계산1동','계산2동','계산3동','계산4동','계산동','귤현동','노오지동','다남동','동양동','둑실동','목상동','박촌동','방축동','병방동','상야동','서운동','선주지동','오류동','용종동','이화동','임학동','작전1동','작전2동','작전동','작전서운동','장기동','평동','하야동','효성1동','효성2동','효성동','인천계양우체국사서함'],
	'인천->남구' : ['선택','관교동','도화1동','도화2동','도화3동','도화동','문학동','숭의1동','숭의2동','숭의3동','숭의4동','숭의동','용현1동','용현2동','용현3동','용현4동','용현5동','용현동','주안1동','주안2동','주안3동','주안4동','주안5동','주안6동','주안7동','주안8동','주안동','학익1동','학익2동','학익동'],
	'인천->남동구' : ['선택','간석1동','간석2동','간석3동','간석4동','간석동','고잔동','구월1동','구월2동','구월3동','구월4동','구월동','남촌동','논현동','도림동','만수1동','만수2동','만수3동','만수4동','만수5동','만수6동','만수동','서창동','수산동','운연동','장수동','남인천우체국사서함'],
	'인천->동구' : ['선택','금곡동','만석동','송림1동','송림2동','송림3동','송림4동','송림5동','송림6동','송림동','송현1동','송현2동','송현3동','송현동','창영동','화수1동','화수2동','화수동','화평동'],
	'인천->부평구' : ['선택','갈산1동','갈산2동','갈산동','구산동','부개1동','부개2동','부개3동','부개동','부평1동','부평2동','부평3동','부평4동','부평5동','부평6동','부평동','산곡1동','산곡2동','산곡3동','산곡4동','산곡동','삼산1동','삼산2동','삼산동','십정1동','십정2동','십정동','일신동','청천1동','청천2동','청천동','북인천우체국사서함'],
	'인천->서구' : ['선택','가정1동','가정2동','가정3동','가정동','가좌1동','가좌2동','가좌3동','가좌4동','가좌동','검암동','경서동','공촌동','금곡동','당하동','대곡동','마전동','백석동','불로동','석남1동','석남2동','석남3동','석남동','시천동','신현동','심곡동','연희동','오류동','왕길동','원당동','원창동','서인천우체국사서함'],
	'인천->연수구' : ['선택','동춘1동','동춘2동','동춘3동','동춘동','선학동','송도동','연수1동','연수2동','연수3동','연수동','옥련1동','옥련2동','옥련동','청학동','인천우체국사서함'],
	'인천->중구' : ['선택','경동','관동1가','관동2가','관동3가','남북동','내동','답동','덕교동','도원동','무의동','북성동1가','북성동2가','북성동3가','사동','선린동','선화동','송월동1가','송월동2가','송월동3가','송학동1가','송학동2가','송학동3가','신생동','신포동','신흥동1가','신흥동2가','신흥동3가','용동','운남동','운북동','운서동','유동','율목동','을왕동','인현동','전동','중산동','중앙동1가','중앙동2가','중앙동3가','중앙동4가','항동1가','항동2가','항동3가','항동4가','항동5가','항동6가','항동7가','해안동1가','해안동2가','해안동3가','해안동4가','인천공항우체국사서함'],
	'인천->강화군' : ['선택','강화읍','교동면','길상면','내가면','불은면','삼산면','서도면','선원면','송해면','양도면','양사면','하점면','화도면'],
	'인천->옹진군' : ['선택','대청면','덕적면','백령면','북도면','연평면','영흥면','자월면'],
	'경기->고양시 덕양구' : ['선택','강매동','고양동','관산동','내곡동','내유동','대자동','대장동','덕은동','도내동','동산동','벽제동','북한동','삼송동','선유동','성사1동','성사2동','성사동','신원동','신평동','오금동','용두동','원당동','원흥동','주교동','지축동','토당동','행신1동','행신2동','행신3동','행신동','행주내동','행주외동','향동동','현천동','화전동','화정1동','화정2동','화정동','효자동','고양덕양우체국사서함'],
	'경기->고양시 일산동구' : ['선택','마두1동','마두2동','마두동','문봉동','백석1동','백석2동','백석동','사리현동','산황동','설문동','성석동','식사동','장항1동','장항2동','장항동','정발산동','중산동','지영동','풍동','고양우편집중국사서함','고양일산우체국사서함'],
	'경기->고양시 일산서구' : ['선택','가좌동','구산동','대화동','덕이동','법곳동','일산1동','일산2동','일산3동','일산동','주엽1동','주엽2동','주엽동','탄현동'],
	'경기->과천시' : ['선택','갈현동','과천동','관문동','막계동','문원동','별양동','부림동','원문동','주암동','중앙동','과천우체국사서함'],
	'경기->광명시' : ['선택','가학동','광명1동','광명2동','광명3동','광명4동','광명5동','광명6동','광명7동','광명동','노온사동','소하1동','소하2동','소하동','옥길동','일직동','철산1동','철산2동','철산3동','철산4동','철산동','하안1동','하안2동','하안3동','하안4동','하안동','광명우체국사서함'],
	'경기->광주시' : ['선택','경안동','목동','목현동','삼동','송정동','쌍령동','역동','장지동','중대동','직동','탄벌동','태전동','회덕동','실촌읍','오포읍','초월읍','남종면','도척면','중부면','퇴촌면'],
	'경기->구리시' : ['선택','갈매동','교문1동','교문2동','교문동','동구동','사노동','수택1동','수택2동','수택3동','수택동','아천동','인창동','토평동','구리우체국사서함'],
	'경기->군포시' : ['선택','광정동','군포1동','군포2동','궁내동','금정동','당동','당정동','대야미동','도마교동','둔대동','부곡동','산본1동','산본2동','산본동','속달동','수리동','오금동','재궁동','군포우체국사서함'],
	'경기->김포시' : ['선택','감정동','걸포동','구래동','마산동','북변동','사우동','운양동','장기동','풍무동','고촌읍','통진읍','대곶면','양촌면','월곶면','하성면'],
	'경기->남양주시' : ['선택','가운동','금곡동','도농동','삼패동','수석동','양정동','이패동','일패동','지금동','평내동','호평동','오남읍','와부읍','진건읍','진접읍','화도읍','별내면','수동면','조안면','퇴계원면'],
	'경기->동두천시' : ['선택','걸산동','광암동','동두천동','보산동','상봉암동','상패동','생연1동','생연2동','생연동','송내동','안흥동','중앙동','지행동','탑동동','하봉암동','동두천우체국사서함'],
	'경기->부천시 소사구' : ['선택','계수동','괴안동','범박동','소사본1동','소사본2동','소사본3동','소사본동','송내1동','송내2동','송내동','심곡본1동','심곡본동','역곡3동','옥길동','남부천우체국사서함'],
	'경기->부천시 오정구' : ['선택','고강1동','고강본동','고강동','내동','대장동','삼정동','여월동','오정동','원종1동','원종2동','원종동','작동','부천우편집중국사서함'],
	'경기->부천시 원미구' : ['선택','도당동','상1동','상2동','상3동','상동','소사동','심곡1동','심곡2동','심곡3동','심곡동','약대동','역곡1동','역곡2동','역곡동','원미1동','원미2동','원미동','중1동','중2동','중3동','중4동','중동','춘의동','부천우체국사서함'],
	'경기->성남시 분당구' : ['선택','구미동','궁내동','금곡동','대장동','동원동','백현동','분당동','삼평동','서현동','석운동','수내동','야탑동','운중동','율동','이매동','정자동','판교동','하산운동','성남분당우체국사서함','성남우편집중국사서함'],
	'경기->성남시 수정구' : ['선택','고등동','금토동','단대동','둔전동','복정동','사송동','산성동','상적동','수진1동','수진2동','수진동','시흥동','신촌동','신흥1동','신흥2동','신흥3동','신흥동','심곡동','양지동','오야동','창곡동','태평1동','태평2동','태평3동','태평4동','태평동','성남우체국사서함'],
	'경기->성남시 중원구' : ['선택','갈현동','금광1동','금광2동','금광동','도촌동','상대원1동','상대원2동','상대원3동','상대원동','성남동','여수동','은행1동','은행2동','은행동','중동','하대원동'],
	'경기->수원시 권선구' : ['선택','고색동','곡반정동','구운동','권선동','금곡동','당수동','대황교동','서둔동','세류1동','세류2동','세류3동','세류동','오목천동','입북동','장지동','탑동','평동','평리동','호매실동'],
	'경기->수원시 영통구' : ['선택','망포동','매탄1동','매탄2동','매탄3동','매탄4동','매탄동','신동','영통1동','영통2동','영통동','원천동','이의동','하동'],
	'경기->수원시 장안구' : ['선택','상광교동','송죽동','연무동','영화동','율전동','이목동','정자1동','정자2동','정자3동','정자동','조원동','천천동','파장동','하광교동','수원우체국사서함'],
	'경기->수원시 팔달구' : ['선택','고등동','교동','구천동','남수동','남창동','매교동','매산로1가','매산로2가','매산로3가','매향동','북수동','신풍동','영동','우만1동','우만2동','우만동','인계동','장안동','중동','지동','팔달로1가','팔달로2가','팔달로3가','화서1동','화서2동','화서동','동수원우체국사서함'],
	'경기->시흥시' : ['선택','거모동','계수동','과림동','광석동','군자동','금이동','논곡동','능곡동','대야동','도창동','매화동','목감동','무지내동','물왕동','미산동','방산동','산현동','신천동','안현동','월곶동','은행동','장곡동','장현동','정왕1동','정왕2동','정왕4동','정왕3동','정왕본동','정왕동','조남동','죽율동','포동','하상동','하중동','화정동','시흥우체국사서함'],
	'경기->안산시 단원구' : ['선택','고잔1동','고잔동','고잔2동','대부남동','대부동동','대부북동','목내동','선감동','선부1동','선부2동','선부3동','선부동','성곡동','신길동','와동','원곡1동','원곡2동','원곡동','원시동','초지동','풍도동','화정동','안산우체국사서함'],
	'경기->안산시 상록구' : ['선택','건건동','본오1동','본오2동','본오3동','본오동','부곡동','사1동','사2동','사3동','사동','사사동','성포동','수암동','양상동','월피동','이동','일동','장상동','장하동','팔곡일동','팔곡이동'],
	'경기->안성시' : ['선택','가사동','가현동','계동','구포동','금산동','금석동','낙원동','당왕동','대천동','도기동','동본동','명륜동','발화동','봉남동','봉산동','사곡동','서인동','석정동','성남동','숭인동','신건지동','신모산동','신소현동','신흥동','아양동','연지동','영동','옥산동','옥천동','인지동','중리동','창전동','현수동','공도읍','고삼면','금광면','대덕면','미양면','보개면','삼죽면','서운면','양성면','원곡면','일죽면','죽산면','안성우체국사서함'],
	'경기->안양시 동안구' : ['선택','갈산동','관양1동','관양2동','관양동','귀인동','달안동','범계동','부림동','부흥동','비산1동','비산2동','비산3동','비산동','신촌동','평안동','평촌동','호계1동','호계2동','호계3동','호계동','안양우체국사서함','안양우편집중국사서함'],
	'경기->안양시 만안구' : ['선택','박달1동','박달2동','박달동','석수1동','석수2동','석수3동','석수동','안양1동','안양2동','안양3동','안양4동','안양5동','안양6동','안양7동','안양8동','안양9동','안양동','서안양우체국사서함'],
	'경기->양주시' : ['선택','고암동','고읍동','광사동','남방동','덕계동','덕정동','마전동','만송동','백석읍','봉양동','산북동','삼숭동','어둔동','옥정동','유양동','율정동','회암동','회정동','광적면','남면','은현면','장흥면'],
	'경기->오산시' : ['선택','가수동','가장동','갈곶동','고현동','궐동','금암동','내삼미동','누읍동','두곡동','벌음동','부산동','서동','서랑동','세교동','수청동','양산동','오산동','외삼미동','원동','은계동','지곶동','청학동','청호동','탑동','오산우체국사서함'],
	'경기->용인시 기흥구' : ['선택','고매동','공세동','구갈동','농서동','동백동','마북동','보라동','보정동','상갈동','상하동','서천동','신갈동','언남동','영덕동','중동','지곡동','청덕동','하갈동'],
	'경기->용인시 수지구' : ['선택','고기동','동천동','상현1동','상현2동','상현동','성복동','죽전1동','신봉동','죽전2동','죽전동','풍덕천1동','풍덕천2동','풍덕천동','용인수지우체국사서함'],
	'경기->용인시 처인구' : ['선택','고림동','김량장동','남동','마평동','삼가동','역북동','운학동','유방동','해곡동','호동','포곡읍','남사면','모현면','백암면','양지면','원삼면','이동면','용인우체국사서함'],
	'경기->의왕시' : ['선택','고천동','내손1동','내손2동','내손동','삼동','오전동','왕곡동','월암동','이동','청계동','초평동','포일동','학의동'],
	'경기->의정부시' : ['선택','가능1동','가능2동','가능3동','가능동','고산동','금오동','낙양동','녹양동','민락동','산곡동','신곡1동','신곡2동','신곡동','용현동','의정부1동','의정부2동','의정부3동','의정부동','자일동','장암동','호원1동','호원2동','호원동','의정부우체국사서함'],
	'경기->이천시' : ['선택','갈산동','고담동','관고동','단월동','대포동','사음동','송정동','안흥동','율현동','장록동','중리동','증일동','증포동','진리동','창전동','부발읍','장호원읍','대월면','마장면','모가면','백사면','설성면','신둔면','율면','호법면','이천우체국사서함'],
	'경기->파주시' : ['선택','검산동','금능동','금촌1동','금촌2동','금촌동','맥금동','아동동','야동동','문산우체국사서함','파주우체국사서함','교하읍','문산읍','법원읍','조리읍','파주읍','광탄면','군내면','월롱면','장단면','적성면','진동면','진서면','탄현면','파평면'],
	'경기->평택시' : ['선택','가재동','군문동','도일동','독곡동','동삭동','모곡동','비전1동','비전2동','비전동','서정동','세교동','소사동','신대동','신장1동','신장2동','신장동','용이동','월곡동','유천동','이충동','장당동','장안동','죽백동','지산동','지제동','청룡동','칠괴동','칠원동','통복동','평택동','합정동','안중읍','팽성읍','포승읍','고덕면','서탄면','오성면','진위면','청북면','현덕면','송탄우체국사서함','평택우체국사서함'],
	'경기->포천시' : ['선택','동교동','선단동','설운동','신읍동','어룡동','자작동','소흘읍','가산면','관인면','군내면','내촌면','신북면','영북면','영중면','이동면','일동면','창수면','화현면'],
	'경기->하남시' : ['선택','감북동','감이동','감일동','광암동','교산동','덕풍1동','덕풍2동','덕풍3동','덕풍동','망월동','미사동','배알미동','상사창동','상산곡동','선동','신장1동','신장2동','신장동','창우동','천현동','초이동','초일동','춘궁동','풍산동','하사창동','하산곡동','학암동','항동'],
	'경기->화성시' : ['선택','기산동','기안동','남양동','능동','무송동','문호동','반송동','반월동','반정동','배양동','병점동','북양동','석우동','송림동','송산동','수화동','시동','신남동','신외동','안녕동','안석동','온석동','원천동','장덕동','장전동','진안동','활초동','황계동','봉담읍','우정읍','향남읍','동탄면','마도면','매송면','비봉면','서신면','송산면','양감면','장안면','정남면','팔탄면'],
	'경기->가평군' : ['선택','가평읍','북면','상면','설악면','청평면','하면'],
	'경기->양평군' : ['선택','양평읍','강상면','강하면','개군면','단월면','서종면','양동면','양서면','옥천면','용문면','지평면','청운면'],
	'경기->여주군' : ['선택','여주읍','가남면','강천면','금사면','능서면','대신면','북내면','산북면','점동면','흥천면'],
	'경기->연천군' : ['선택','연천읍','전곡읍','군남면','미산면','백학면','신서면','왕징면','장남면','중면','청산면']
	};
	this.sido = document.getElementById('sido');
	this.gugun = document.getElementById('gugun');
	this.dong = document.getElementById('dong');
	var parent = this;

	makeOption('시도', this.sido);
	if (sido) this.sido.value = sido;
	if (gugun) { 
		makeOption(sido, this.gugun);
		this.gugun.value = gugun;
	}
	if (dong) { 
		makeOption(sido + '->' + gugun,  this.dong);
		this.dong.value = dong;
	}
	this.sido.onchange = function() { 		
		makeOption(this.value, parent.gugun);
		makeOption(this.value + '->' + parent.gugun.value, parent.dong);
	};
	this.gugun.onchange = function() {
		makeOption(parent.sido.value + '->' + this.value, parent.dong);
	};
	function makeOption(idx, obj) {
		var html = '', i=0; 
		for (; i<addr[idx].length; i++) html += '<option value="'+addr[idx][i]+'">'+addr[idx][i]+'</option>';
		
		obj.innerHTML = html;
		$(obj).html(html);
	}
}


</script>



	<!-- 서브 콘텐츠 -->
	<div class="content_right" style="display:block">
	
		<!-- 게시판 시작 -->
		<div class="col-lg-12" style="padding:0;margin-bottom:30px;">
			<h3>꼼꼼한 서울씨 <span style="color:red;">제 ${vo.poll_num}기</span> 회원가입</h3>
			<p>▶ 서울시 홈페이지 통합회원으로 실명인증이 확인된 만 19세 이상의 서울특별시 거주 시민만 가입이 가능합니다.</p>
		</div>
    
		<div class="col-lg-12" style="padding:0;">
		<h3>▥ 서울시 회원정보</h3>
		</div>
		<div class="col-lg-12" style="float:left;padding:0;">
			<label class="information"><span style="color:#4374D9;">※ 해당정보를 수정하시려면 
				<a href="https://www.seoul.go.kr/seoul/servlet/seoul?div=mem&a=UserInfoViewRenewalApp" style="text-decoration:underline;" target="_blank">
			<span style="color:#990085">서울시 홈페이지 > 마이서울 > 회원정보 변경</span></a>을 이용해 주세요</span></label>
		</div>
		

		<table class="pc_notice_table" style="width:100%;background:#fff;border:none;border-spacing:0;padding:0;">
			<tr>
				<td>
	  
					<table class="table_02 mypage_table">
						<colgroup>
							<col width="15%;">
							<col width="85%;">
						</colgroup>
						<tbody>
							<tr>
								<th>* 아이디</th>
								<td>
									<input type="text" readonly name="id" id="w_id">
										<span style="margin-left:5%;"> 
											<input type="button" id="login_btt" value="서울시 통합회원 로그인" onclick="onSSO()">  
										</span>
								</td>
							</tr>
							
							<tr>
								<th>* 이름</th>
								<td><input type="text" readonly id="name"></td>
							</tr>
							
							<tr>
								<th>* 연락처</th>
								<td>
									<input type="text" readonly id="phone">
									  
									<span style="margin-left:5%;"> 
										<input type="radio" disabled id="phone_type" value="01"/> 집&nbsp;&nbsp;
										<input type="radio" disabled id="phone_type" value="02"/> 직장&nbsp;&nbsp;
										<input type="radio" disabled id="phone_type" value="03"/> 휴대폰
									</span>
									
								</td>
							</tr>
							<tr>
								<th>* 이메일</th>
								<td>
									<input type="text" readonly id="email">
								</td>
							</tr>
							<tr>
								<th>* 거주지</th>
								<td>
									<input type="text" readonly id="sidoji" >
									&nbsp;&nbsp;&nbsp;&nbsp; <font color="red">※ 서울, 경기, 인천 거주자만 가입 가능</font>
								</td>
							</tr>
							<tr>
								<th>* 생년월일</th>
								<td>
									<input type="text" readonly id="birth">
									&nbsp;&nbsp;&nbsp;&nbsp; <font color="red">※ 만 19세 이상만 가입 가능</font>
								</td>
							</tr>
						</tbody>
						

					</table>
				</td>
			</tr>
		</table>
		

<!-- 모바일 화면 -->
		<table class="mobile_notice_table" style="width:100%;background:#fff;border:none;border-spacing:0;padding:0;">
			<tr align="right">
				<td>
					<input type="button" id="login_btt1" value="서울시 통합회원 로그인" onclick="onSSO()">  
				</td>
			</tr>
			<tr>
				<td>
	  
					<table class="table_02 mypage_table" style="margin-top:10px;">
						<colgroup>
							<col width="30%;">
							<col width="70%;">
						</colgroup>
						<tbody>
							<tr>
								<th>* 아이디</th>
								<td><span id="m_id"></span></td>
							</tr>						
							<tr>
								<th>* 이름</th>
								<td><span id="m_name"></span></td>
							</tr>
							<tr>
								<th>* 연락처</th>
								<td>
									<span style="float:left;" id="m_phone"></span><br>
									<span class="radioGroup">
										<input type="radio" disabled id="phone_type1" value="01"/>집&nbsp;
										<input type="radio" disabled id="phone_type1" value="02"/>직장&nbsp;
										<input type="radio" disabled id="phone_type1" value="03"/>휴대폰
									</span>
								</td>
							</tr>
							<tr>
								<th>* 이메일</th>
								<td><div id="m_email"></div></td>
							</tr>
							<tr>
								<th>* 거주지</th>
								<td id="m_sido"></td>
							</tr>
							<tr>
								<th>* 생년월일</th>
								<td id="m_birth"></td>
							</tr>
						</tbody>
						

					</table>
				</td>
			</tr>
		</table>


		
<form id="w_form">		

	<input type="hidden" name="id" id="id" value="">
	<input type="hidden" name="poll_num" value="${vo.poll_num}">
 		<table class="" style="width:100%;background:#fff;border:none;border-spacing:0;padding:0;">
			<tr>
				<td>
					<div style="margin-top:50px; padding:0;">
						<h3>▥ 추가입력정보</h3>
      			<label class="information"><span style="color:#4374D9;">※ 별표(*)는 필수입력 사항입니다.(과제별 모니터요원 선정 시 참고자료 및 통계처리에 활용)</span></label>
            <label class="information"><span style="color:#4374D9;">※ 성별정보는 신청 후에는 수정이 불가하니 정확하게 체크해 주세요.</span></label>								
					</div>
				</td>
			</tr>

			<tr>
				<td>
	  
					<table class="table_02 mypage_table">
						<colgroup>
							<col width="35%;">
							<col width="65%;">
						</colgroup>
						<tbody>
							<tr>
								<th>* 성별</th>
								<td>
									<div class="radioGroup" style="float:left;">
										<input type="radio" id="sex" name="sex" value="M"/> 남자&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <input type="radio" id="sex" name="sex" value="W"/> 여자 
									</div>
								</td>
							</tr>
							<tr>
								<th>* 직업</th>
								<td>
									<select style="height:25px;width:40%;" name="job" id="w_job">
										<option value="">(선택)</option>
										<option value="가정주부">가정주부</option>
										<option value="대학생">대학생</option>
										<option value="회사원">회사원</option>
										<option value="전문,자유직" >전문,자유직</option>										
										<option value="자영업">자영업</option>
										<option value="무직">무직</option>
										<option value="교육직">교육직</option>
										<option value="공무원">공무원</option>
										<option value="기타">기타</option>
									</select>
								</td>
							</tr>
							<tr>
								<th>* 상세거주지</th>
								<td>
									<select name="sido" id="sido" style="height: 100%;display:none"><option value="">-시도-</option></select>
									<select name="gugun" id="gugun" style="height: 25px;"><option value="">-구군-</option></select>
									<select name="dong" id="dong" style="height: 25px;"><option value="">-동-</option></select>		

								</td>
							</tr>
						</tbody>
						

					</table>
				</td>
			</tr>


			<tr>
				<td>
					<div style="text-align:right;margin-top:40px;">
						<button type="button" class="btn"  onclick="onApply()">가입 신청</button>
						<button type="button" class="btn" onclick="location.href='<c:url value='/front/main.do'/>'">취소</button>
					</div>
				</td>
			</tr>
		</table>

</form>
		
		

		<div class="clearfix divider_dashed7"></div>
 
	</div>


</div>

<script>

$( document ).ready(function() {

	var id = $("#sso_id").val();

	if(id != "null")
	{
		$("#login_btt").val("로그아웃");
		$("#login_btt1").val("로그아웃");
	}


});

</script>
